[
  {
    "title": "From Graphic Designer to Front-End Developer",
    "slug": "from-graphic-designer-to-front-end-developer",
    "date": "2026-02-14",
    "content": "A few years ago, I was designing on static canvases. Today, I design in the browser.\n\nI started as a graphic designer, obsessed with grids, spacing, and color harmony. Over time, I realized I didn’t just want to design interfaces — I wanted to build them. That curiosity pushed me into front-end development.\n\n## The Virtual Art Gallery\n\nTo merge my design background with my growing CSS skills, I created a **Virtual Art Gallery** — a CSS-only showcase inspired by modern art styles.\n\nEverything is built using HTML5 and CSS3. No images. No libraries. Just pure CSS.\n\nIn this project, I experiment with:\n\n- CSS Grid\n- Flexbox\n- Animations & transitions\n- Pseudo-elements\n- Responsive layouts\n\nThe gallery is fully responsive and continuously evolving as I improve. It’s both my creative playground and my front-end portfolio.\n\n## Building Python XP\n\nWhile growing visually on the front end, I’m also strengthening my logic with Python.\n\nI’m currently building a simple task tracker that allows users to:\n\n- Add tasks\n- Mark tasks as completed\n- Delete tasks\n- View task lists\n\nIt’s a small console app, but it’s helping me think more structurally and improve my problem-solving skills.\n\n## The Transition\n\nBecoming a developer didn’t replace design — it expanded it.\n\nNow I don’t just design how things look. I build how they work.\n\nAnd honestly, writing CSS still feels like painting — just with semicolons."
  },
  {
    "title": "Deep Dive Into JavaScript: Adding Functionality to Design",
    "slug": "deep-dive-javascript",
    "date": "2026-02-03",
    "content": "JavaScript is essential in turning a static design into an interactive experience. In this post, I’ll dive deep into how JavaScript can enhance design by adding interactivity.\n\nI’ll share how animations, user interactions, and dynamic changes can be achieved with just a few lines of code. Through JavaScript, I’m now able to create interfaces that not only look great but respond to user behavior—whether that’s a smooth transition, a custom animation, or even real-time data updates."
  },
  {
    "title": "Open Source Thoughts",
    "slug": "open-source",
    "date": "2026-01-06",
    "content": "As a designer transitioning into development, I’ve discovered that the open-source community is an invaluable resource. Open source projects allow developers and designers to collaborate, learn from each other, and contribute to projects that can impact the world.\n\nIn this post, I’ll talk about the importance of contributing to open-source projects and how it’s helped me grow. Not only have I learned new development skills, but I’ve also gained a deeper understanding of collaborative design. Whether it’s fixing bugs or improving UI components, being part of the open-source ecosystem has made me a better developer."
  },
  {
    "title": "Productivity Systems",
    "slug": "productivity-systems",
    "date": "2025-10-07",
    "content": "One of the most important lessons I’ve learned as I’ve transitioned from design to development is the importance of **productivity systems**. As a designer, I had the luxury of focusing on creativity, but as a developer, I’m constantly balancing both the creative and logical sides of my brain.\n\nTo stay productive, I’ve adopted tools like Trello for task management, and GitHub for version control. But beyond tools, I’ve also focused on creating productive habits—like working in blocks of time, regularly reviewing my goals, and using resources like online communities and open-source projects to keep learning. In this post, I’ll talk about how I’ve structured my time and projects to stay on track and make the most of my learning."
  },
  {
    "title": "Frontend Architecture",
    "slug": "frontend-architecture",
    "date": "2025-08-08",
    "content": "When you’re transitioning from graphic design to UI/UX development, one of the first challenges is learning how to structure your projects efficiently. Frontend architecture is a critical aspect of creating maintainable, scalable web applications.\n\nI’ll explain how I’m applying the concepts of reusable components, modular CSS, and responsive design into my workflow. With each new project, I’m refining my approach to ensure that my design systems can grow with the needs of the project. This post will also touch on the importance of organization and documentation in maintaining a smooth development process."
  },
  {
  "title": "Embracing Responsive Design: Designing for All Devices",
  "slug": "embracing-responsive-design",
  "date": "2025-02-01",
  "content": "As I moved deeper into the world of UI/UX development, one of the most important skills I had to master was **responsive design**. Coming from a graphic design background, I was used to creating static, fixed-size designs. But the web is far from static—designs need to work across a wide range of devices, from mobile phones to large desktop screens.\n\nIn this post, I’ll share how I approached making my designs responsive and the tools I used to ensure they looked great on any device. Using **media queries**, **flexbox**, and **grid layouts**, I’ve learned to design interfaces that adapt smoothly to different screen sizes. This shift was a key milestone in my journey, as it forced me to think not just about aesthetics, but also about how users experience interfaces in different contexts.\n\nI’ll also discuss best practices for designing with mobile-first principles and how ensuring accessibility and usability for all users became a top priority in my process."
  },
  {
    "title": "From Motion to Interaction",
    "slug": "motion-interaction",
    "date": "2025-01-05",
    "content": "Here, I share insights, tutorials, and personal reflections on my transition from static designs to interactive, user-focused creations. You'll find content about the intersection of design and technology, the art of crafting intuitive digital interfaces, and tips for balancing creativity with functionality. I also discuss tools, resources, and best practices in both design and development—from Photoshop and After Effects to Figma, Sketch, and coding languages like HTML, CSS, and JavaScript.\n\n<BR>Whether you're a fellow designer looking to make the leap into UI/UX development, a developer interested in the design side of things, or just someone curious about the creative process, I invite you to explore the blog and join me as I continue to learn, grow, and create in this dynamic field."
  }
]


